
print("---------------------------TASK 1-----------------------------")
# 1.  Напишіть скрипт-гру, яка генерує випадковим чином число з діапазону чисел від 1 до 100 і пропонує користувачу вгадати це число.
# Програма зчитує числа, які вводить користувач і видає користувачу підказки про те чи загадане число більше чи менше за введене користувачем.
# Гра має тривати до моменту поки користувач не введе число, яке загадане програмою, тоді друкує повідомлення привітання.
# (для виконання завдання необхідно імпортувати  модуль random, а з нього функцію randint())
from random import randint as ri

correct_answer = ri(1,100)
warm_zone_1 = correct_answer - 5
warm_zone_2 = correct_answer + 5
while True:
    user_answer = int(input("Введіть число: "))
    if user_answer > correct_answer:
        print ("Твоє число більше загаданого")
    elif user_answer < correct_answer:
        print ("Твоє число менше загаданого")
    elif user_answer==correct_answer:
        print("Вітаю. Ти вгадав")
        break




print("---------------------------TASK 2-----------------------------")
# 2.  Напишіть скрипт, який обчислює площу прямокутника a*b, площу трикутника 0.5*h*a, площу кола pi*r**2.
# (для виконання завдання необхідно імпортувати  модуль math, а з нього функцію pow() та значення змінної пі).

import math

task = int(input("Площу якої фігури ви хочете обчислити Прямокутник - 1, Трикутник - 2, Коло - 3: "))
if task == 1:
    x = float(input("Сторона A: "))
    y = float(input("Сторона В: "))
    area = area_of_the_rectangle(x,y)
    print("Площа прямокутника: ", area)

elif task == 2:
    x = float(input("Катет A: "))
    y = float(input("Катет В: "))
    area = 0.5*x*y
    print("Площа трикутнкика: ", area)

elif task == 3:
    r = float(input("Раріус кола: "))
    area = math.pi*math.pow(r,2)
    print("Площа кола: ", area)


