print("---------------------------TASK 1-----------------------------")
# 1.  Написати функцію, яка знаходить середнє арифметичне значення довільної кількості чисел.
def average_of_numbers (*args):
    return sum(args)/len(args)
print ("Середнє  арифметичне: ", average_of_numbers(1,15,654,44,5256,74))

print("---------------------------TASK 2-----------------------------")
# 2.  Написати функцію, яка повертає абсолютне значення числа
def absolute_number (num):
    return abs(num)
print(absolute_number(-25))

print("---------------------------TASK 3-----------------------------")
# 3.  Написати функцію, яка знаходить максимальне число з двох чисел, а також в функції використати рядки документації DocStrings.
def finding_maximum_of_two (x,y):
    return max(x,y)
print(finding_maximum_of_two(34,23))

print("---------------------------TASK 4-----------------------------")
# 4.  Написати програму, яка обчислює площу прямокутника, трикутника та кола (написати три функції для обчислення площі, і викликати їх в головній програмі в залежності від вибору користувача)
def area_of_the_rectangle (x,y)
    return x*y
def area_of_the_triangle (a,b)
    return 0.5 * x*y

